In [23]:
# TODO 
# Task 1
# provide a query that shows total sales by each sales agent
# will require to join with the customer table
# will require to join with the invoice table

# Task 2
# QUERY TO find the top selling track of 2012
# will require use track table
# will requiret to join with invoice items table
# will require to join with the invoice table

In [24]:
import sqlite3
import pandas as pd

In [25]:
class SqliteCRUD:
    
    # constructor
    # called when we create an object of this class
    def __init__(self, dbpath):
        self.dbpath = dbpath
        self.conn = sqlite3.connect(dbpath)
        self.cursor = self.conn.cursor()
        # print status  
        print(f"Connected to database: {dbpath} Ready to perform CRUD operations!")
    
    # destructor - will be called when object is deleted - typically when program ends
    def __del__(self):
        print("Closing connection")
        self.conn.close()

    def total_sales(self):
        query = """
        SELECT EmployeeId,
	        e.LastName AS employees,
	        SUM(total) AS Total_sales	
            FROM employees e
            JOIN invoices i  ON e.EmployeeId  = i.CustomerId 
            JOIN customers c  ON e.EmployeeId = c.SupportRepId
            GROUP  BY EmployeeId;
        """
        return pd.read_sql_query(query, self.conn)

In [26]:
db = SqliteCRUD("chinook.db")
db.dbpath

Connected to database: chinook.db Ready to perform CRUD operations!
Closing connection

'chinook.db'

In [27]:
total_sales_df = db.total_sales()
total_sales_df.head()

   EmployeeId employees  Total_sales
0           3   Peacock       832.02
1           4      Park       792.40
2           5   Johnson       731.16